## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.virtual_machines.azurerm_linux_virtual_machine.game will be created
  + resource "azurerm_linux_virtual_machine" "game" {
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "swedencentral"
      + max_bid_price                                          = -1
      + name                                                   = "cs1"
      + network_interface_ids                                  = [
          + "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/networkInterfaces/game-nic",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "cs2-servers"
      + size                                                   = "Standard_D4as_v4"
      + virtual_machine_id                                     = (known after apply)

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvY9YBkn72I68uqx4xBElJaZNW/J69Yt/UcS6cGUKUjc5JVs4qYW5Mpn/c4gDWqeSupTb1DAb0sK50kSX+wUCqZH1P6RCSzM8/1rs2kwRcNvNEtqc8/S0hvz9aQunmBft/8YgmhvYGQiboUNkZQAWVlyvCS3lcDBdcq0YUzi4TAz35EcxlGsP2uTCuUGYpgsHIwYNvMYnRlOAzLXKszYf7xL1kwMz4xQDXZh+ggP2prcVCIRnaOBL18aiqaI+QLiVYZpx0qHRaMj2nvJ5goynus1iulrY3R0wmz8e6KkyGI4TfM+yoj0RKl9hfmq1jcXb+aer507s0l8tIqp26BLFQJv1vZjAIWiJ090C6dr/zkgKRVTh0+FsVEWxgC7O0epaUPTN0+Oxpi2itsW8TIm/rteturACLEcTza81ZUHbXZh38OzUaU0SaVpCPmOLn9F4rBXD6QkgWNdjOV8i+0A4u0/xFC1J1rmpINIJOe/llWK6+qkndIcN+4IlVg6Fw4IU= ekos@DESKTOP-QIMMA0H"
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 50
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>